IDEA Open Model
DeflectionRequirementEc2 Enumeration
Compatible with IDEA StatiCa 20.1
 deflection calculation requirements
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public enum DeflectionRequirementEc2
Public Enumeration DeflectionRequirementEc2
Members
Member name | Value | Description
Normal | 0 |  The appearance and general utility of the structure could be impaired when the calculated sag of a beam, slab or cantilever subjected to quasi-permanent loads exceeds span/250.
Advanced | 1 |  Deflections that could damage adjacent parts of the structure should be limited.
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace